package lib.sjy.dialog.value;

/**
 * 弹窗颜色 默认颜色
 * Created by sjy on 2017/11/23.
 */

public class DialogColor {
    /**
     * 默认统一颜色设置
     */
    public static final int common_bg = 0xFFFFFFFF;
    public static final int common_cl = 0xFF58BEFF;

    /**
     * ==============================================================================================
     * ===============================================标题===============================================
     * ==============================================================================================
     */
    /**
     * 标题背景色
     * 白色
     */
    public static final int title_bg_cl = common_bg;

    /**
     * 标题文本色
     */
    public static final int title_cl = common_cl;

    /**
     * ==============================================================================================
     * ===============================================按钮===============================================
     * ==============================================================================================
     */
    /**
     * 按钮背景色
     */
    public static final int btn_bg_sure_cl = common_cl;

    /**
     * 按钮背景色
     */
    public static final int btn_bg_cancel_cl = 0xFFd8d8d8;


    /**
     * 按钮文本色
     * 白色
     */
    public static final int btn_text_srue_cl = common_bg;

    /**
     * 按钮点击颜色
     */
    public static final int buttonPress = 0xFFeaeaea;
    /**
     * 线条颜色
     */
    public static final int divider = common_cl;

    /**
     * ==============================================================================================
     * ===============================================text===============================================
     * ==============================================================================================
     */


    /**
     * 消息内容颜色
     */
    public static final int content_txt_cl = 0xFF333333;

    /**
     * 消息内容背景颜色
     */
    public static final int content_bg_cl = common_bg;
    /**
     * ==============================================================================================
     * ===============================================text===============================================
     * ==============================================================================================
     */
    /**
     * 输入框边框颜色
     */
    public static final int inputStroke = 0xFF808080;


}
